/*
Copyright (c) 2003-2026, CKSource Holding sp. z o.o. All rights reserved.
CKEditor 4 LTS ("Long Term Support") is available under the terms of the Extended Support Model.
*/
CKEDITOR.plugins.setLang( 'liststyle', 'km', {
	bulletedTitle: 'លក្ខណៈ​សម្បត្តិ​បញ្ជី​ជា​ចំណុច',
	circle: 'រង្វង់​មូល',
	decimal: 'លេខ​ទសភាគ (1, 2, 3, ...)',
	disc: 'ថាស',
	lowerAlpha: 'ព្យញ្ជនៈ​តូច (a, b, c, d, e, ...)',
	lowerRoman: 'លេខ​រ៉ូម៉ាំង​តូច (i, ii, iii, iv, v, ...)',
	none: 'គ្មាន',
	notset: '<not set>',
	numberedTitle: 'លក្ខណៈ​សម្បត្តិ​បញ្ជី​ជា​លេខ',
	square: 'ការេ',
	start: 'ចាប់​ផ្ដើម',
	type: 'ប្រភេទ',
	upperAlpha: 'អក្សរ​ធំ (A, B, C, D, E, ...)',
	upperRoman: 'លេខ​រ៉ូម៉ាំង​ធំ (I, II, III, IV, V, ...)',
	validateStartNumber: 'លេខ​ចាប់​ផ្ដើម​បញ្ជី ត្រូវ​តែ​ជា​តួ​លេខ​ពិត​ប្រាកដ។'
} );
