/*
Copyright (c) 2003-2026, CKSource Holding sp. z o.o. All rights reserved.
CKEditor 4 LTS ("Long Term Support") is available under the terms of the Extended Support Model.
*/
CKEDITOR.plugins.setLang( 'forms', 'km', {
	button: {
		title: 'លក្ខណៈ​ប៊ូតុង',
		text: 'អត្ថបទ (តម្លៃ)',
		type: 'ប្រភេទ',
		typeBtn: 'ប៊ូតុង',
		typeSbm: 'ដាក់ស្នើ',
		typeRst: 'កំណត់​ឡើង​វិញ'
	},
	checkboxAndRadio: {
		checkboxTitle: 'លក្ខណៈ​ប្រអប់​ធីក',
		radioTitle: 'លក្ខនៈ​ប៊ូតុង​មូល',
		value: 'តម្លៃ',
		selected: 'បាន​ជ្រើស',
		required: 'Required' // MISSING
	},
	form: {
		title: 'លក្ខណៈ​បែបបទ',
		menu: 'លក្ខណៈ​បែបបទ',
		action: 'សកម្មភាព',
		method: 'វិធីសាស្ត្រ',
		encoding: 'ការ​អ៊ិនកូដ'
	},
	hidden: {
		title: 'លក្ខណៈ​វាល​កំបាំង',
		name: 'ឈ្មោះ',
		value: 'តម្លៃ'
	},
	select: {
		title: 'លក្ខណៈ​វាល​ជម្រើស',
		selectInfo: 'ព័ត៌មាន​ជម្រើស',
		opAvail: 'ជម្រើស​ដែល​មាន',
		value: 'តម្លៃ',
		size: 'ទំហំ',
		lines: 'បន្ទាត់',
		chkMulti: 'អនុញ្ញាត​ពហុ​ជម្រើស',
		required: 'Required', // MISSING
		opText: 'អត្ថបទ',
		opValue: 'តម្លៃ',
		btnAdd: 'បន្ថែម',
		btnModify: 'ផ្លាស់ប្តូរ',
		btnUp: 'លើ',
		btnDown: 'ក្រោម',
		btnSetValue: 'កំណត់​ជា​តម្លៃ​ដែល​បាន​ជ្រើស',
		btnDelete: 'លុប'
	},
	textarea: {
		title: 'លក្ខណៈ​ប្រអប់​អត្ថបទ',
		cols: 'ជួរឈរ',
		rows: 'ជួរដេក'
	},
	textfield: {
		title: 'លក្ខណៈ​វាល​អត្ថបទ',
		name: 'ឈ្មោះ',
		value: 'តម្លៃ',
		charWidth: 'ទទឹង​តួ​អក្សរ',
		maxChars: 'អក្សរអតិបរិមា',
		required: 'Required', // MISSING
		type: 'ប្រភេទ',
		typeText: 'អត្ថបទ',
		typePass: 'ពាក្យសម្ងាត់',
		typeEmail: 'អ៊ីមែល',
		typeSearch: 'ស្វែង​រក',
		typeTel: 'លេខ​ទូរសព្ទ',
		typeUrl: 'URL'
	}
} );
